УТ/src/DataProcessors/ТоварыНаКонтролеКачества/ТоварыНаКонтролеКачества.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ТоварыНаКонтролеКачества</name>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>СрокКонтроля</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтролируемаяПартия</name>
      <type>
        <types>CatalogRef.КонтролируемыеПартии</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.СкладскиеПомещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Заблокировано</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕстьВПроцессеПеремещения</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СвободныйОстатокНаСкладе</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоЗаявкаНаКонтроль</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ/src/Documents/АктКонтроляКачестваТоваров/АктКонтроляКачестваТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>АктКонтроляКачестваТоваров</name>
  <basedOn>Document.ПриобретениеТоваровУслуг</basedOn>
  <basedOn>Document.ПоступлениеТоваровНаСклад</basedOn>
  <basedOn>Document.ПоступлениеТоваровОтКлиента</basedOn>
  <basedOn>Document.ПоступлениеТоваровОтХранителя</basedOn>
  <basedOn>Document.СборкаТоваров</basedOn>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.ПрочееОприходованиеТоваров</basedOn>
  <basedOn>Document.ВозвратТоваровОтКлиента</basedOn>
  <basedOn>Document.ЗаявкаНаКонтрольКачестваТоваров</basedOn>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияСерийТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОформлениюИзлишковНедостач</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВЯчейках</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКПоступлению</registerRecords>
  <registerRecords>AccumulationRegister.ЗапасыИПотребности</registerRecords>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыАктовКонтроляКачества</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.СкладскиеПомещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролируемаяПартия</name>
    <type>
      <types>CatalogRef.КонтролируемыеПартии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ВозвратТоваровОтКлиента</types>
      <types>DocumentRef.ПриобретениеТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеТоваровНаСклад</types>
      <types>DocumentRef.ПоступлениеТоваровОтКлиента</types>
      <types>DocumentRef.ПоступлениеТоваровОтХранителя</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.СборкаТоваров</types>
      <types>DocumentRef.ПриемкаТоваровНаХранение</types>
      <types>DocumentRef.ЗаявкаНаКонтрольКачестваТоваров</types>
      <types>DocumentRef.ПрочееОприходованиеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперацияПартии</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартнерПартии</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеПартии</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>Помещение</name>
      <type>
        <types>CatalogRef.СкладскиеПомещения</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.СкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Действие</name>
      <type>
        <types>EnumRef.ДействияПоТоварамВАктеКонтроляКачества</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РезультатПроверкиКачества</name>
      <type>
        <types>EnumRef.РезультатыПроверкиКачестваТоваров</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураОприходование</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаОприходование</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодНазначение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>УпаковкаОприходование</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОприходование</name>
      <comment>Количество приходуемое (в единицах хранения)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыИсследования</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заключение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Исследование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УТ/src/DataProcessors/ТоварыНаКонтролеКачества/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	ИнициализацияНастройкиСписка();
	Элементы.НастройкиОтбор.Видимость = УстановленОтбор();
	// Обработчик механизма "Назначения".
	Справочники.Назначения.ФормаДокументаПриСозданииНаСервере(ЭтотОбъект);
	ЗаявкаОформлена = Неопределено;
	ИспользуютсяИсследованияТоваров = ИспользуютсяИсследованияТоваров();
	ГиперссылкаПриАктивизации(АктивнаяГиперссылка(ЗаявкаОформлена).Имя, Истина);
	ВосстановитьНастройкиФормыПриСоздании();
	ЗапуститьЗаданиеЗагрузитьТовары();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)
	
	ПриИзмененииОтбораНаСервере();
	ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ПриИзмененииОтбораНаСервере();
	ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	ПриИзмененииОтбораНаСервере();
	ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	Данные = Неопределено;
	
	Если Поле = Элементы.ТоварыКонтролируемаяПартия Тогда
		
		Данные = РеквизитПартия(Элемент.ТекущиеДанные.КонтролируемаяПартия)
		
	ИначеЕсли Поле = Элементы.ТоварыЗаблокировано И Элемент.ТекущиеДанные.ЕстьВПроцессеПеремещения Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Есть незавершенное перемещение заблокированного товара.'"));
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные) Тогда
		ПоказатьЗначение(, Данные);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВсеГиперссылка(Команда)
	
	ГиперссылкаПриАктивизации(Элементы.ВсеГиперссылка.Имя);
	ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаОформленаГиперссылка(Команда)
	
	ГиперссылкаПриАктивизации(Элементы.ЗаявкаОформленаГиперссылка.Имя);
	ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаНеОформленаГиперссылка(Команда)
	
	ГиперссылкаПриАктивизации(Элементы.ЗаявкаНеОформленаГиперссылка.Имя);
	ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьАктКонтроляКачества(Команда)
	
	ВыбранныеСтроки = Элементы.Товары.ВыделенныеСтроки;
	Если ВыбранныеСтроки.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбрано ни одной строки списка товаров. Команда не выполнена'"));
		Возврат;
		
	КонецЕсли;
	
	КонтролируемаяПартия = Объект.Товары.НайтиПоИдентификатору(ВыбранныеСтроки[0]).КонтролируемаяПартия;
	Для Каждого ВыбраннаяСтрока Из ВыбранныеСтроки Цикл
		Если Объект.Товары.НайтиПоИдентификатору(ВыбраннаяСтрока).КонтролируемаяПартия <> КонтролируемаяПартия Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Необходимо выбрать строки, относящиеся к одной контролируемой партии. Один ""Акт контроля качества"" на несколько контролируемых партий не может быть создан.'"));
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	Аналитики = ПоместитьАналитикиВХранилище(Ложь);
	ОткрытьФорму(
		"Документ.АктКонтроляКачестваТоваров.Форма.ФормаДокумента",
		Новый Структура("ЗаполнитьПоОстаткам,Аналитики", Истина, Аналитики),
		ЭтотОбъект,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОформитьЗаявкуНаКонтрольКачества(Команда)
	
	Если Элементы.Товары.ВыделенныеСтроки.Количество() = 0 Тогда
		
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбрано ни одной строки списка товаров. Команда не выполнена'"));
		Возврат;
		
	КонецЕсли;
	
	ЕстьСтроки = Ложь;
	Для Каждого Идентификатор Из Элементы.Товары.ВыделенныеСтроки Цикл
		
		Если Не Объект.Товары.НайтиПоИдентификатору(Идентификатор).ЭтоЗаявкаНаКонтроль Тогда
			ЕстьСтроки = Истина;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ЕстьСтроки Тогда
		
		ПоказатьПредупреждение(,
			НСтр("ru = 'Заявку на контроль качества товаров нельзя создать для контролируемых партий, связанных с другими заявками на контроль качества товаров.'"));
		Возврат;
		
	КонецЕсли;
	
	Аналитики = ПоместитьАналитикиВХранилище(Истина);
	ДанныеЗаполнения = КонтрольКачестваКлиентСервер.НовыеДанныеЗаполненияЗаявкиНаКонтрольКачестваТоваров();
	ДанныеЗаполнения.ПричинаБлокировкиТовара
		= ПредопределенноеЗначение("Справочник.ПричиныБлокировкиТоваров.ВходнойКонтрольКачестваТовара");
	
	ОткрытьФорму(
		"Документ.ЗаявкаНаКонтрольКачестваТоваров.Форма.ФормаДокумента",
		Новый Структура("ЗаполнитьПоОстаткам,Аналитики,ДанныеЗаполнения", Истина, Аналитики, ДанныеЗаполнения),
		ЭтотОбъект,
		УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	ЗапуститьЗаданиеЗагрузитьТовары();
	ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	
КонецПроцедуры

&НаКлиенте
Процедура АктыКонтроляКачества(Команда)
	
	ОткрытьФорму("Документ.АктКонтроляКачестваТоваров.Форма.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкиНаКонтрольКачества(Команда)
	
	Если ИспользуютсяИсследованияТоваров Тогда
		Возврат;
	Иначе
		ОткрытьФорму("Документ.ЗаявкаНаКонтрольКачестваТоваров.Форма.ФормаСписка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСписок(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("АдресСхемы", АдресСхемыКомпоновкиДанныхНастройкиСписка);
	ПараметрыФормы.Вставить("НастройкиСписка", НастройкиСписка);
	ОписаниеОповещения = Новый ОписаниеОповещения("НастройкаСпискаЗавершение", ЭтотОбъект);
	ОткрытьФорму("Отчет.НастройкаСписка.Форма.НастройкаСписка", ПараметрыФормы, , , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиСписка(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("КлючОбъекта", "ТоварыНаКонтролеКачества");
	ПараметрыФормы.Вставить("КлючНастроек", "ТоварыНаКонтролеКачества.НастройкаСписка");
	ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьНастройкиСпискаЗавершение", ЭтотОбъект);
	ОткрытьФорму("ФормаСохраненияПользовательскихНастроекДинамическихСписков", 
			ПараметрыФормы,
			,
			,
			,
			, 
			ОписаниеОповещения, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНастройкиСписка(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("КлючОбъекта", "ТоварыНаКонтролеКачества");
	ПараметрыФормы.Вставить("КлючНастроек", "ТоварыНаКонтролеКачества.НастройкаСписка");
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьНастройкиСпискаЗавершение", ЭтотОбъект);
	ОткрытьФорму("ФормаЗагрузкиПользовательскихНастроекДинамическихСписков", 
			ПараметрыФормы,
			,
			,
			,
			, 
			ОписаниеОповещения, 
			РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗагрузкаСпискаТоваров

&НаСервере
Процедура ЗапуститьЗаданиеЗагрузитьТовары()
	
	Если РезультатВыполненияЗаданияЗаполненияТоваров <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СхемаКомпоновкиДанных = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанныхНастройкиСписка);
	
	// Загрузка СКД
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновкиДанных));
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиСписка.ПолучитьНастройки());
	КомпоновщикНастроек.Восстановить();
	
	ИспользуемыеНастройки = КомпоновщикНастроек.ПолучитьНастройки();
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ИмяФункции = "Обработки.ТоварыНаКонтролеКачества.ВыполнитьЗаданиеЗаполненияТоваров";
	
	ПараметрыФункции = КонтрольКачестваКлиентСервер.ПараметрыЗаполненияТоваровДляКонтроляКачества();
	ПараметрыФункции.Отбор.Склад = ?(ЗначениеЗаполнено(Склад), Склад, Неопределено);
	ПараметрыФункции.Отбор.Номенклатура = ?(ЗначениеЗаполнено(Номенклатура), Номенклатура, Неопределено);
	ПараметрыФункции.Отбор.Назначение = ?(ЗначениеЗаполнено(Назначение), Назначение, Неопределено);
	ПараметрыФункции.Отбор.ЗаявкаОформлена = ?(ЗначениеЗаполнено(ЗаявкаОформлена), ЗаявкаОформлена, Неопределено);
	ПараметрыФункции.НастройкиКомпоновки = ИспользуемыеНастройки;
	
	РезультатВыполненияЗаданияЗаполненияТоваров = ДлительныеОперации.ВыполнитьФункцию(
		ПараметрыВыполнения, ИмяФункции, ПараметрыФункции);
	
	Если РезультатВыполненияЗаданияЗаполненияТоваров.Статус = "Выполнено" Тогда
		ЗагрузитьТовары(РезультатВыполненияЗаданияЗаполненияТоваров.АдресРезультата);
		РезультатВыполненияЗаданияЗаполненияТоваров = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров()
	
	Если РезультатВыполненияЗаданияЗаполненияТоваров <> Неопределено Тогда
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ПараметрыОжидания.ФормаВладелец = ЭтотОбъект;
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗагрузитьТоварыОбработчикОповещения", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(
			РезультатВыполненияЗаданияЗаполненияТоваров, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьТоварыОбработчикОповещения(Результат, ДополнительныеПараметры) Экспорт
	
	РезультатВыполненияЗаданияЗаполненияТоваров = Неопределено;
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ЗагрузитьТовары(Результат.АдресРезультата);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьТовары(АдресХранилища)
	
	Таблица = ПолучитьИзВременногоХранилища(АдресХранилища);
	Объект.Товары.Загрузить(Таблица);
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииОтбораНаСервере()
	
	СохранитьНастройкиФормы();
	ЗапуститьЗаданиеЗагрузитьТовары();
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиФормы

&НаСервере
Процедура ВосстановитьНастройкиФормыПриСоздании()
	
	НастройкиФормы = ХранилищеНастроекДанныхФорм.Загрузить(
		МенеджерНастроекКлючОбъекта(), МенеджерНастроекКлючНастроек());
	Если ЗначениеЗаполнено(НастройкиФормы) Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиФормы()
	
	НастройкиФормы = СохраняемыеНастройкиФормы();
	
	ЗаполнитьЗначенияСвойств(НастройкиФормы, ЭтотОбъект);
	ХранилищеНастроекДанныхФорм.Сохранить(
		МенеджерНастроекКлючОбъекта(), МенеджерНастроекКлючНастроек(), НастройкиФормы);
	
КонецПроцедуры

&НаСервере
Функция СохраняемыеНастройкиФормы()
	
	Результат = Новый Структура;
	Результат.Вставить("Склад");
	Результат.Вставить("Номенклатура");
	Результат.Вставить("Назначение");
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция МенеджерНастроекКлючОбъекта()
	
	Возврат "ТоварыНаКонтролеКачества";
	
КонецФункции

&НаСервере
Функция МенеджерНастроекКлючНастроек()
	
	Возврат "НастройкиФормы";
	
КонецФункции

#КонецОбласти

#Область НастройкаСписков

&НаСервере
Процедура ИнициализацияНастройкиСписка()
	
	Отборы = Обработки.ТоварыНаКонтролеКачества.ПолучитьМакет("Отборы");
	АдресСхемыКомпоновкиДанныхНастройкиСписка = ПоместитьВоВременноеХранилище(Отборы, УникальныйИдентификатор);
	ИсточникДоступныхНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиДанныхНастройкиСписка);
	НастройкиСписка.Инициализировать(ИсточникДоступныхНастроек);
	НастройкиСписка.ЗагрузитьНастройки(Отборы.НастройкиПоУмолчанию);
	
КонецПроцедуры

&НаКлиенте
Процедура НастройкаСпискаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("КомпоновщикНастроекКомпоновкиДанных") Тогда
		НастройкаСпискаНаСервере(РезультатЗакрытия);
		ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция УстановленОтбор()
	
	ЭлементыОтбора = НастройкиСписка.ПолучитьНастройки().Отбор.Элементы;
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		Если ЭлементОтбора.Использование Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

&НаСервере
Процедура НастройкаСпискаНаСервере(Знач КомпоновщикНастроек)
	
	НастройкиСписка.ЗагрузитьНастройки(КомпоновщикНастроек.ПолучитьНастройки());
	НастройкиСписка.ЗагрузитьПользовательскиеНастройки(КомпоновщикНастроек.ПользовательскиеНастройки);
	Элементы.НастройкиОтбор.Видимость = УстановленОтбор();
	ЗапуститьЗаданиеЗагрузитьТовары();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНастройкиСпискаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("ВыборНастроек") Тогда
		ВыбратьНастройкиСпискаНаСервере(РезультатЗакрытия.КлючНастроек);
		ПодключитьОбработчикОжиданияВыполненияЗаданияЗаполненияТоваров();
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура ВыбратьНастройкиСпискаНаСервере(Знач КлючНастроек)
	
	Отчеты.НастройкаСписка.ЗагрузитьНастройкиИзХранилища(
		"ТоварыНаКонтролеКачества.НастройкаСписка",
		КлючНастроек,
		НастройкиСписка);
	Элементы.НастройкиОтбор.Видимость = УстановленОтбор();
	ЗапуститьЗаданиеЗагрузитьТовары();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройкиСпискаЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) = Тип("ВыборНастроек") Тогда
		СохранитьНастройкиСпискаНаСервере(РезультатЗакрытия.КлючНастроек);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура СохранитьНастройкиСпискаНаСервере(Знач КлючНастроек)
	
	Отчеты.НастройкаСписка.СохранитьНастройкиВХранилище(
		"ТоварыНаКонтролеКачества.НастройкаСписка",
		КлючНастроек,
		НастройкиСписка);
	
КонецПроцедуры

#КонецОбласти

#Область Исследования

&НаСервереБезКонтекста
Функция ИспользуютсяИсследованияТоваров()
	
	ИспользоватьИсследования = Ложь;
	Возврат ИспользоватьИсследования;
	
КонецФункции

#КонецОбласти

&НаСервере
Функция АктивнаяГиперссылка(ЗаявкаОформлена)
	
	Если ЗаявкаОформлена = Неопределено Тогда
		Возврат Элементы.ВсеГиперссылка;
	ИначеЕсли ЗаявкаОформлена = Истина Тогда
		Возврат Элементы.ЗаявкаОформленаГиперссылка;
	Иначе
		Возврат Элементы.ЗаявкаНеОформленаГиперссылка;
	КонецЕсли;
	
КонецФункции

&НаСервере
Процедура ГиперссылкаПриАктивизации(ИмяЭлемента, Инициализация = Ложь)
	
	Элемент = Элементы[ИмяЭлемента];
	Элементы.ВсеГиперссылка.Доступность = Истина;
	Элементы.ЗаявкаОформленаГиперссылка.Доступность = Истина;
	Элементы.ЗаявкаНеОформленаГиперссылка.Доступность = Истина;
	Элемент.Доступность = Ложь;
	
	Если Не Инициализация Тогда
		
		Если Элемент = Элементы.ВсеГиперссылка Тогда
			ЗаявкаОформлена = Неопределено;
		ИначеЕсли Элемент = Элементы.ЗаявкаОформленаГиперссылка Тогда
			ЗаявкаОформлена = Истина;
		Иначе
			ЗаявкаОформлена = Ложь;
		КонецЕсли;
		
		ЗапуститьЗаданиеЗагрузитьТовары();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	НачалоТекущегоДня = НачалоДня(ТекущаяДатаСеанса());
	
	// Просрочненный срок контроля.
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Подсветка просроченного срока контроля.'");
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСрокКонтроля.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСрокКонтроля.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСрокКонтроля.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ОтборЭлемента.ПравоеЗначение = НачалоТекущегоДня;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.ПросроченныйДокумент);
	
	// Партии заблокированные навсегда.
	Элемент = УсловноеОформление.Элементы.Добавить();
	Элемент.Представление = НСтр("ru = 'Партии заблокированные навсегда.'");
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСрокКонтроля.Имя);
	
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСрокКонтроля.ПутьКДанным);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	Элемент.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<разблокировка не планируется>'"));
	
КонецПроцедуры

&НаСервере
Функция ПоместитьАналитикиВХранилище(ИсключатьЗаявкиНаКонтроль)
	
	Строки = Новый Массив(Элементы.Товары.ВыделенныеСтроки.Количество());
	Индекс = 0;
	Для Каждого ИдентификаторСтроки Из Элементы.Товары.ВыделенныеСтроки Цикл
		Строки[Индекс] = Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
		Индекс = Индекс + 1;
	КонецЦикла;
	КлючСтроки =
		"КонтролируемаяПартия,
		|Номенклатура,
		|Характеристика,
		|Склад,
		|Назначение,
		|Помещение,
		|Серия,
		|ЭтоЗаявкаНаКонтроль";
	Аналитики = Объект.Товары.Выгрузить(Строки, КлючСтроки);
	Если ИсключатьЗаявкиНаКонтроль Тогда
		Аналитики = Аналитики.Скопировать(Новый Структура("ЭтоЗаявкаНаКонтроль", Ложь));
	КонецЕсли;
	Аналитики.Колонки.Удалить("ЭтоЗаявкаНаКонтроль");
	АдресВХранилище = ПоместитьВоВременноеХранилище(Аналитики, УникальныйИдентификатор);
	Возврат АдресВХранилище;
	
КонецФункции

&НаСервереБезКонтекста
Функция РеквизитПартия(КонтролируемаяПартия)
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КонтролируемаяПартия, "Партия");
	
КонецФункции

#КонецОбласти
